Revit 2027 API
GridNode Constructor
Initializes a new instance of the GridNode class
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GridNode(
	int uIndex,
	int vIndex
)
Public Sub New (
	uIndex As Integer,
	vIndex As Integer
)
public:
GridNode(
	int uIndex,
	int vIndex
)
new :
        uIndex : int *
        vIndex : int -> GridNode
Parameters
uIndex Int32
vIndex Int32
See Also
Reference
GridNode Structure
Autodesk.Revit.DB Namespace